#include<stdio.h>
int main(void)
{
	printf("[%d]\n",			123);//原始状态				[123]
	printf("[%.4d]\n",			123);//保留4位		 		[0123]
	printf("[%4d]\n",			123);//共4位，前空格        [_123]
	printf("[%04d]\n",			123);//前4个0 				[0123]
	printf("[%-4d]\n",			123);//左对齐               [123_]
	printf("[%-04d]\n",			123);//左对齐,补空格        [123_] 
	 
	printf("[%d]\n",			12345);//                  【12345】 
	printf("[%.3d]\n",			12345);//显示必要的位数   【12345】 
	printf("[%3d]\n",			12345);//				 【12345】 
	printf("[%03d]\n",			12345);//				【12345】 
	printf("[%-3d]\n",			12345);//		    	【12345】 
		
	printf("[%f]\n",			123.13);//默认保留6位小数 				[123.130000]
	printf("[%.1f]\n",			123.13);// 保留1位      				[123.1]
	printf("[%6.1f]\n",			123.13);//共6位有效数字，小数点后1位，总字符宽度，包括小数点    [_ 123.1] 
	
	printf("[%f]\n",			123.13);//								[123.130000]
	printf("[%.1f]\n",			123.13);//								[123.1]
	printf("[%3.1f]\n",			123.13);//输出数据原长度				[123.1]
	
	printf("[%-6.1f]\n",			123.13);//左对齐，后补空格			[123.1_]
	return (0);
}
